Tekla.Structures.DirectManipulation.Model.InterOpExtensions
The Tekla.Structures.DirectManipulation.Model.InterOpExtensions class is an extension class for general purpose interoperation conversion methods.

Tekla.Structures.DirectManipulation.Model.InterOpExtensions.Convert(Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t)
Converts an instance of Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t into a Tekla.BIM.Geometry.Face3.
This method also free the unmanaged memory after the conversion.
dotFace: The data to be converted.
Returns: The converted Tekla.BIM.Geometry.Face3.

Tekla.Structures.DirectManipulation.Model.InterOpExtensions.Convert(System.Collections.Generic.IEnumerable{Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t})
Converts a collection of Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t into a list of Tekla.BIM.Geometry.Face3.
dotFaces: The data to be converted.
Returns: The converted list of Tekla.BIM.Geometry.Face3.

Tekla.Structures.DirectManipulation.Model.InterOpExtensions.Convert(Tekla.BIM.Geometry.Face3,Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t@)
Converts an instance of Tekla.BIM.Geometry.Face3 into a Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t.
face: The data to be converted.
dotFace: The converted Tekla.Structures.DirectManipulation.Model.Native.dotDMFace_t.
Returns: The handle to dispose of all the managed resources after marshaling.

Tekla.Structures.DirectManipulation.Model.InterOpExtensions.Convert(Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t)
Converts a collection of Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t into a key/value pair of
the owning object ID and the list of Tekla.BIM.Geometry.Face3.
This method also free the unmanaged memory after the conversion.
dotFaces: The data to be converted.
Returns: The key/value pair of the owning object ID and the list of Tekla.BIM.Geometry.Face3.

Tekla.Structures.DirectManipulation.Model.InterOpExtensions.Convert(System.Collections.Generic.ICollection{Tekla.BIM.Geometry.Face3},System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t@)
Converts an instance of Tekla.BIM.Geometry.Face3 into a Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t.
faces: The Tekla.Structures.DirectManipulation.Model.Native.dotDMObjectFaces_t instance.
objectId: The object identifier.
dotFaces: The dot faces.
Returns: The handle to dispose of all the managed resources after marshaling.